# 1. 홍길동 씨의 과목별 점수는 다음과 같다. 홍길동 씨의 평균 점수를 구해 보자.
# 국어 : 80, 영어 : 75, 수학 : 55
from re import A
from unittest import result


hong = {'korean':80, 'english':75, 'mathematics':55}
average = sum(hong.values())/len(hong)
print("홍길동씨의 평균점수는 %s 입니다." % average)
#------------------------------------------------------------------------------------------------------------

# 2.자연수 13이 홀수인지 짝수인지 판별할수 있는 방법에 대해 말해 보자.
naturalnum = 13
if naturalnum%2 ==1 :
    print("%d는 짝수입니다." % naturalnum)
else :
    print("%d는 짝수입니다." % naturalnum)
#------------------------------------------------------------------------------------------------------------

# 3.홍길동씨의 주민등록번호는 881120-1068234이다.
# 홍길동씨의 주민등록번호를 연월일(YYYYMMDD)부분과 그 뒤의 숫자 부분으로 나누어 출력해 보자.
pin = "881120-10638234"
yyyymmdd = pin[:6]
num = pin[7:]
print(yyyymmdd)
print(num)

# 4.주민등록번호 뒷자리의 맨 첫 번째 숫자는 성별을 나타낸다. 주민등록번호에서 성별을 나타내는 숫자를 출력해보자.
pin = "881120-1068234"
if int(pin[7]) >= 5 or int(pin[7])== 0:
    print("잘못입력하셨습니다.")
elif int(pin[7]) % 2 == 1 :
    print("남성")
else :
    print("여성")
#------------------------------------------------------------------------------------------------------------

# 5.다음과 같은 문자열 a:b:c:d가 있다. 문자열의 replace함수를 사용하여 a#b#c#d로 바꿔서 출력해보자.
a = "a:b:c:d"
print(a.replace(":","#"))
#------------------------------------------------------------------------------------------------------------

# 6.[1, 3, 5, 4, 2] 리스트를 [5, 4, 3, 2, 1]로 만들어 보자.
a = [1, 3, 5, 4, 2]
a.sort()
a.reverse()
print(a)
#------------------------------------------------------------------------------------------------------------

# 7.['Life','is','too','short']리스트를 Life is too short 문자열로 만들어 출력해보자.
a = ['Life', 'is', 'too' , 'short']
result = " ".join(a)
print(result)
#------------------------------------------------------------------------------------------------------------

# 8.(1,2,3)튜플에 값 4를 추가하여 (1,2,3,4)를 만들어 출력해보자
a = (1, 2, 3)
a = a + (4,)
print(a)

#------------------------------------------------------------------------------------------------------------

# 9.딕셔너리 a에서 'B'에 해당되는 값을 추출해 보자.
a = {'A':90,'B':80,'C':70}
print(a.get('B'))
#------------------------------------------------------------------------------------------------------------

# 10.a 리스트에서 중복 숫자를 제거해 보자
a = [1, 1, 1, 2, 2, 3, 3, 3, 4, 4, 5]
aSet = set(a)
b = list(aSet)
print(b)
#------------------------------------------------------------------------------------------------------------
